; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-3-10)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-1 - location
	p0-2 - location
	p1-4 - location
	p3-2 - location
	p4-0 - location
	p4-3 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s1)
	(at driver3 s0)
	(at driver4 s4)
	(at driver5 s3)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s1)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s4)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s2)
	(at package2 s0)
	(at package3 s3)
	(at package4 s2)
	(at package5 s0)
	(at package6 s0)
	(at package7 s2)
	(at package8 s4)
	(at package9 s2)
	(at package10 s1)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 95)
	(= (time-to-drive s2 s0) 95)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 87)
	(= (time-to-drive s4 s0) 87)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 85)
	(= (time-to-drive s3 s1) 85)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 98)
	(= (time-to-drive s1 s2) 98)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 100)
	(= (time-to-drive s4 s2) 100)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 85)
	(= (time-to-drive s0 s3) 85)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 80)
	(= (time-to-drive s2 s3) 80)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 40)
	(= (time-to-drive s1 s4) 40)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s4)
	(at driver2 s1)
	(at driver5 s1)
	(at truck1 s1)
	(at truck2 s1)
	(at package1 s4)
	(at package2 s4)
	(at package3 s3)
	(at package4 s0)
	(at package6 s0)
	(at package8 s0)
	(at package9 s2)
	(at package10 s1)
	))

(:metric minimize (+ (* 2 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (board-truck driver4 truck3 s4)
   deleted: (at driver4 s4) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 6 of 13
2. (load-truck package8 truck3 s4)
   deleted: (at package8 s4)
   added: (in package8 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 6 of 13
3. (drive-truck truck3 s4 s2 driver4)
   deleted: (at truck3 s4)
   added: (at truck3 s2)
   changed: (fuel-used) from 0 to 1100
   goals met: 6 of 13
4. (walk driver1 s3 p4-3)
   deleted: (at driver1 s3)
   added: (at driver1 p4-3)
   goals met: 6 of 13
5. (walk driver1 p4-3 s4)
   deleted: (at driver1 p4-3)
   added: (at driver1 s4)
   goals met: 7 of 13
6. (load-truck package1 truck3 s2)
   deleted: (at package1 s2)
   added: (in package1 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 7 of 13
7. (load-truck package4 truck3 s2)
   deleted: (at package4 s2)
   added: (in package4 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 7 of 13
8. (drive-truck truck3 s2 s4 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s4)
   changed: (fuel-used) from 1100 to 2700
   goals met: 7 of 13
9. (walk driver5 s3 p4-3)
   deleted: (at driver5 s3)
   added: (at driver5 p4-3)
   goals met: 7 of 13
10. (walk driver5 p4-3 s4)
   deleted: (at driver5 p4-3)
   added: (at driver5 s4)
   goals met: 7 of 13
11. (unload-truck package1 truck3 s4)
   deleted: (in package1 truck3)
   added: (at package1 s4)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 8 of 13
12. (walk driver5 s4 p1-4)
   deleted: (at driver5 s4)
   added: (at driver5 p1-4)
   goals met: 8 of 13
13. (walk driver5 p1-4 s1)
   deleted: (at driver5 p1-4)
   added: (at driver5 s1)
   goals met: 9 of 13
14. (walk driver3 s0 p0-2)
   deleted: (at driver3 s0)
   added: (at driver3 p0-2)
   goals met: 9 of 13
15. (walk driver3 p0-2 s2)
   deleted: (at driver3 p0-2)
   added: (at driver3 s2)
   goals met: 9 of 13
16. (board-truck driver3 truck1 s2)
   deleted: (at driver3 s2) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 9 of 13
17. (drive-truck truck1 s2 s1 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 2700 to 3680
   goals met: 10 of 13
18. (drive-truck truck3 s4 s0 driver4)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   changed: (fuel-used) from 3680 to 4811
   goals met: 10 of 13
19. (unload-truck package4 truck3 s0)
   deleted: (in package4 truck3)
   added: (at package4 s0)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 11 of 13
20. (unload-truck package8 truck3 s0)
   deleted: (in package8 truck3)
   added: (at package8 s0)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 12 of 13
21. (load-truck package2 truck3 s0)
   deleted: (at package2 s0)
   added: (in package2 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 12 of 13
22. (drive-truck truck3 s0 s4 driver4)
   deleted: (at truck3 s0)
   added: (at truck3 s4)
   changed: (fuel-used) from 4811 to 5768
   goals met: 12 of 13
23. (unload-truck package2 truck3 s4)
   deleted: (in package2 truck3)
   added: (at package2 s4)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 13 of 13
